import 'package:flutter/material.dart';
import 'package:shelem_shomar/Widgets/side_drawer.dart';
import 'package:shelem_shomar/generated/i18n.dart';

class HelpPage extends StatelessWidget {
  final List<String> helpString = [
    'شلم',
    'شلم یا روکن یکی از بازی‌های پاسور است که بعد از حکم، محبوب‌ترین بازی ورق در میان ایرانیان محسوب می‌شود. '
        'شلم از واژه "Slam" انگلیسی و "Chelem" فرانسوی گرفته شده‌است و معنی آن جمع‌آوری تمام برگ‌های (دست‌های) بازی است. '
        'هدف این بازی زودتر رسیدن به امتیاز توافق شده (معمولاً ۱۶۵) است. '
        'شلم یک بازی چهارنفره است که می‌شود آن را سه یا دونفره هم بازی کرد. '
        'این بازی، از بازی حکم حرفه‌ای‌تر بوده و دارای هیجان و ظرافت بیشتری هم هست. بنابراین برای بازی شلم بایستی با بازی حکم آشنا بود، '
        'چراکه قوانین بازی و سر کردن ورق‌ها در آن کاملاً مشابه حکم هست با این تفاوت که امتیاز شماری در آن اهمیت زیادی دارد و در خواندن دست‌ها باید دقت ویژه‌ای را به‌ خرج داد.',
    'شرح مختصر بازی',
    'در این بازی هر بازیکن ۱۲ برگ دریافت می‌کند. '
        'سپس شروع به خواندن امتیازی که می‌توانند بگیرند می‌کنند. '
        'مثلاً ۱۲۵ امتیاز از کل ۱۶۵ امتیاز ممکن یا ۲۰۰ امتیاز در صورت وجود جوکر در بازی. '
        'کسی که امتیاز بالاتری را بخواند به عنوان حاکم تعیین می‌شود. '
        'سپس او با همکاری یارش باید تلاش کند تا امتیاز تعهد شده را کسب کند. '
        'در اینصورت او به همان تعداد امتیاز که کسب کرده امتیاز دریافت می‌کند. '
        'بازی ادامه خواهد داشت تا وقتی که یک تیم زودتر به امتیاز نهایی برسد. '
        'در این بازی بردن هر دست ۵ امتیاز دارد. ',
    'هر ۵ لو، ۵ امتیاز ‚ هر ۱۰ لو، ۱۰ امتیاز و هر تک (آس) هم ۱۰ امتیاز دارد، '
        'جوکر قرمز ۲۰ امتیاز و جوکر مشکی ۱۵ امتیاز. '
        'به این ترتیب در مجموع کل امتیاز یک بازی۲۰۰ امتیاز است. ',
    'این بازی بدون جوکر و با مجموع ۱۶۵ امتیاز هم انجام می شود. '
        'پخش کردن ورق هم توسط لیدر به تشخیص وی می‌باشد که می‌تواند به صورت دلخواه از نظر تعداد و تنوع تعدادی بین افراد توزیع نماید. '
        'در صورتی که در پایان بازی (بازی آخر) هر دو تیم به امتیاز نهایی برسد تیمی برنده است که امتیاز بیشتری را کسب کرده‌است.',
    '۱۶۵ : هر دست ۵، هر ۵ لو ۵، هر ۱۰ لو ۱۰ و هر آس ۱۰ امتیاز ',
    '۱۸۵ : هر دست ۵، هر ۵ لو ۵، هر ۱۰ لو ۱۰ و هر آس ۱۵ امتیاز ',
    '۲۰۰ : هر دست ۵، هر ۵ لو ۵، هر ۱۰ لو ۱۰، هر آس ۱۰، ژوکر سیاه ۱۵ وژوکر رنگی ۲۰ امتیاز ',
    '۲۳۰ :هر دست ۵، هر ۵ لو ۵، هر ۱۰ لو ۱۰، هر آس ۱۵، ژوکر سیاه ۲۰ وژوکر رنگی ۲۵ امتیاز',
    'شرح کامل بازی',
    'الف (دست دادن: یک نفر از بین چهار نفر با قرعه به عنوان اولین پاسور) دست دهنده (انتخاب می‌شود. '
        'در دست‌های بعد به ترتیب از سمت راست دیگران دست می‌دهند. '
        'به نحوی که بعد از چهار دور بازی همه یک بار دست داده باشند و به همین ترتیب دست دادن می‌چرخد. '
        'نفری که دست می‌دهد ابتدا ۱۲ برگ به نفر سمت راست، ۱۲ برگ به نفر روبه رو، '
        '۱۲ برگ به نفر سمت چپ، ۴ برگ به پشت روی زمین و ۱۲ برگ آخر را برای خود دست می‌دهد) '
        'توجه کنید که کسی که دست را پخش میکند میتواند چهار برگ وسط را بعد از نفر دوم یا سوم یا چهارم روی زمین بگذارد (در این‌جا مرحله دست دادن تمام می‌شود. ',
    'ب (تعهد کردن) اعلان -خواندن(: نفر سمت راست پس از مرتب کردن دستش امتیازی را فکر می‌کند می‌تواند بگیرد را اعلام می‌کند.'
        ' این امتیاز نمی‌تواند زیر ۱۰۰ باشد. پس از آن نوبت نفر سمت راست او است.'
        ' او یا باید امتیازی بالاتر از امتیاز خوانده شده را بخواند یا اعلام “پاس“ کند.'
        ' کسی که پاس دهد دیگر نمی‌تواند در امتیاز خوانی تا پایان این دور بازی شرکت کند. '
        'سپس نوبت نفر سمت راست او می‌رسد. '
        'او هم به همین ترتیب‚ یا باید بالاتر از آخرین امتیاز خوانده شده بخواند یا پاس دهد. '
        'این مرحله آنقدر ادامه می‌یابد تا ۳ نفر پاس کرده و کسی که آخرین امتیاز را خوانده به عنوان حاکم بازی را آغاز می‌کند. ',
    'ج (آغاز بازی: بعد از مشخص شدن حاکم‚ او ۴ برگ روی زمین را برمی‌دارد و به جای آن ۴ برگ به دلخواه خود زمین می‌گذارد. '
        'این کار برای بهبود دست حاکم و کمک به او برای کسب امتیاز تعهد شده صورت می‌گیرد.'
        ' پس از این که او ۴ برگ را زمین گذاشت) که این برگها جزء برگهای برده حساب می‌شوند (حاکم با پائین انداختن برگ حکم، بازی را شروع می‌کند.'
        ' (دقت کنید که حتماً برگ اول باید برگی از خال حکم باشد و این کار در واقع اعلام حکم است) سپس به همان ترتیب حکم،'
        ' بازیکنان از سمت راست شروع به بازی می‌کنند.'
        ' بازی دقیقاً مانند حکم پیش می‌رود تا برگها تمام شوند. ',
    'د (شمارش امتیاز: بعد از پایان بازی نوبت به شمارش امتیازها می‌رسد. برای این کار برگهای برنده شده را می‌شماریم‚'
        ' در ازای هر ۴ برگ) یک دست از بازی) ۵ امتیاز ‚ '
        'در ازای هر برگ ۵لو، ۵ امتیاز‚ در ازای هر برگ ۱۰ لو، ۱۰ امتیاز و در ازای هر برگ تک) آس (هم ۱۰ امتیاز منظور می‌شود.'
        ' بعد از شمردن امتیاز یک تیم (معمولا تیم رقیب حاکم) ‚ در یک روش با کم کردن آن از ۱۶۵، امتیاز تیم دیگر مشخص می‌شود. '
        'در روشی دیگر تیم حاکم فقط به میزان امتیازی که تعهد کرده دریافت خواهد کرد حتی اگر بیشتر از آن دست جمع کرده باشد. '
        'در هر دو صورت، اگر تیم حاکم امتیازی را که تعهد کرده ‚'
        ' یا بیشتر از آن امتیاز را گرفته باشد حداقل امتیاز تعهده کرده را دریافت خواهد کرد و برنده آن دست به حساب می آید. '
        'اما اگر کمتر از آن امتیاز تعهد شده باشد‚ منفی آن امتیاز تعهد شده را دریافت خواهد کرد. '
        'تیم رقیب هم هر اندازه که امتیاز بگیرد برایش منظور خواهد شد.',
    'قانون شلم',
    'الف) شلم یا شلم مثبت: اگر تیم حاکم موفق به جمع کردن کلیه برگ‌ها شود، در چنین حالتی به اندازه امتیازات کسب شده به تیم حاکم اضافه می‌شود. '
        'در نسخه ای دیگر‌‌ نیز تیم مقابل به اندازه‌ همان امتیاز (معمولا ۱۶۵) منفی‌ میخورد. (مشخص است که تیم حاکم هرگز شلم نمی‌شود‚ '
        'زیرا در اول بازی فرد حاکم چهار برگ را به عنوان برده از دست خود خارج می‌کند). ',
    'ب) شلم خواندن: اگر تیمی هنگام دست خواندن اعلام کند که همهٔ دست‌ها را می‌گیرد (شلم بخواند)، '
        'در صورت موفق شدن ۳۳۰ امتیاز می‌گیرد و اگر نتواند کل برگها را بگیر ۳۳۰ امتیاز از دست می‌دهد. '
        'اگر تیمی ۱۶۵ خوانده باشد تیم بعدی میتواند شلم بخواند ',
    'مراحل خواندن بعد از ۱۶۰بشرح ذیل می‌باشد ۱۶۵ (یعنی همانند دیگر اعداد با ان رفتار خواهد شد) بعد از ان شلم (یعنی قبول ۳۳۰ عدد منفی) '
        'و بعد از ان کُنس می‌باشد که یعنی هر که ان دست را ببرد کل بازی را برده‌است و '
        'اگر ببازد کل بازی را باخته‌است سوای امتیاز کسب شده و تابلوی اعداد تا ان لحظه. '
        'منتهی طرفین بازی هر دو باید کنس شدن بازی را قبول کنند و الا بازی بر مبنای تابلوی اعلانات پیش خواهد رفت. '
        'معمولاً اگر تابلوی اعداد هر دو گروه بالای ۱۰۰۰ باشد بازیکنان اجازه پیدا می‌کنند که بعد از عدد شلم، '
        'کنس بخوانند ولی باید کنس شدن بازی را همه بازیکنان قبول کنند و الا بالاترین عدد خوانده شده همان شلم خواهد بود.',
    'جدول بازی',
    'برای نگهداری و ثبت امتیازها یک جدول سه ستونی مانند شکل زیر کشیده می‌شود. '
        'هر یک از ستون‌های چپ و راست متعلق به یک تیم است و در ستون وسط امتیاز تعهد شده در هر بازی را می‌نویسم. '
        'همچنین بعد از اینکه هر چهار بازیکن دست دادند و دوباره نوبت دست دادن به نفر اول رسید‚ '
        'یک خط افقی در ستون وسط می‌کشیم تا مشخص شود که دست دادن دست بعد با چه کسی است ',
    'مثالی از بازی:',
    ' الف‚ ب‚ ج و د نام چهار بازیکن ما می‌باشد که به ترتیب در سمت راست یکدیگر نشسته‌اند. '
        'پس الف و ج در یک تیم و ب و د نیز در یک تیم هستند: ',
    'دور اول:جدول امتیازات را می‌کشیم. دست دادن هم از بازیکن الف شروع می‌شود. '
        'ابتدا ب که در سمت راست الف نشسته باید شروع به خواندن بکند. او می‌خواند ۱۱۰، ج می‌خواند ۱۱۵، د پاس می‌دهد. '
        'الف می‌خواند ۱۲۵، ب می‌خواند ۱۳۰، ج پاس می‌دهد.'
        ' (اینک فقط الف و ب مانده‌اند (الف می‌خواند ۱۳۵ و ب پاس می‌دهد. بازی انجام می‌شود و تیم ب و د ۳۵ امتیاز دریافت می‌کند و '
        'در نتیجه امتیاز تیم الف و ج ۱۳۰ می‌شود:(۱۶۵–۳۵=۱۳۰) در این حالت امتیاز تیم ب و د همان ۳۵ امتیاز ثبت می‌شود، '
        'اما تیم الف و ج به دلیل اینکه نتوانسته‌اند تعهدشان را انجام دهند ۱۳۵ امتیاز منفی می‌خورند. : ',
    'دور دوم: حالا نوبت ب است که دست بدهد. پس از دست دادن ج باید اعلان کند. '
        'او مستقیماً پاس می‌دهد. د می‌خواند ۱۲۵، الف پاس می‌دهد. ب هم پاس می‌دهد. '
        'پس د با ۱۲۵ امتیاز تعهد شده حاکم می‌شود. تیم ب و د موفق می‌شود ۱۵۰ امتیاز بگیرد. '
        'پس تعهد خود را انجام داده‌است. پس تیم ب و د ۱۵۰امتیاز و تیم الف و ج ۱۵ امتیاز گرفته‌است. ',
    'دور سوم: ج دست می‌دهد. د می‌خواند ۱۰۰‚ الف می‌خواند ۱۲۰‚ ‚ب می‌خواند ۱۲۵‚ ج پاس می‌دهد. '
        'د می‌خواند ۱۳۰‚الف می‌خواند ۱۳۵‚ب می‌خواند ۱۴۰‚ د پاس می‌دهد. '
        'الف می‌خواند ۱۵۰ و ب هم پاس می‌دهد. پس الف با ۱۵۰ امتیاز حاکم می‌شود. '
        'بازی انجام می‌شود و تیم الف و ج موفق به جمع کردن همه برگ‌ها و در نتیجه شلم کردن می‌شود. '
        'پس ۳۳۰امتیاز می‌گیرد و تیم ب و د هیچ امتیازی نمی‌گیرد.',
  ];

  Widget _title(String text) {
    return Text(
      text,
      style: TextStyle(fontSize: 28.0, color: Colors.blue),
      textAlign: TextAlign.justify,
      textDirection: TextDirection.rtl,
    );
  }

  Widget _body(String text) {
    return Text(
      text,
      style: TextStyle(
        fontSize: 18.0,
      ),
      textAlign: TextAlign.center,
      textDirection: TextDirection.rtl,
    );
  }

  @override
  Widget build(BuildContext context) {
    return Scaffold(
        appBar: AppBar(
          title: Text(S.of(context).help),
        ),
        drawer: SideDrawer(),
        body: Column(
          mainAxisAlignment: MainAxisAlignment.center,
          children: <Widget>[
            Expanded(
              child: Padding(
                padding: EdgeInsets.all(14.0),
                child: Center(
                  child: SingleChildScrollView(
                    child: Column(
                      mainAxisAlignment: MainAxisAlignment.center,
                      crossAxisAlignment: CrossAxisAlignment.start,
                      children: <Widget>[
                        _title(helpString[0]),
                        _body(helpString[1]),
                        SizedBox(height: 14.0),
                        _title(helpString[2]),
                        _body(helpString[3]),
                        SizedBox(height: 14.0),
                        _body(helpString[4]),
                        SizedBox(height: 14.0),
                        _body(helpString[5]),
                        SizedBox(height: 14.0),
                        Card(
                          margin: EdgeInsets.all(25.0),
                          child: Padding(
                            padding: EdgeInsets.all(8.0),
                            child: Column(
                              children: <Widget>[
                                _body(helpString[6]),
                                SizedBox(height: 14.0),
                                _body(helpString[7]),
                                SizedBox(height: 14.0),
                                _body(helpString[8]),
                                SizedBox(height: 14.0),
                                _body(helpString[9]),
                              ],
                            ),
                          ),
                        ),
                        SizedBox(height: 14.0),
                        _title(helpString[10]),
                        _body(helpString[11]),
                        SizedBox(height: 14.0),
                        _body(helpString[12]),
                        SizedBox(height: 14.0),
                        _body(helpString[13]),
                        SizedBox(height: 14.0),
                        _body(helpString[14]),
                        SizedBox(height: 14.0),
                        _title(helpString[15]),
                        _body(helpString[16]),
                        SizedBox(height: 14.0),
                        _body(helpString[17]),
                        SizedBox(height: 14.0),
                        _body(helpString[18]),
                        SizedBox(height: 14.0),
                        _title(helpString[19]),
                        _body(helpString[20]),
                        SizedBox(height: 14.0),
                        _body(helpString[21]),
                        SizedBox(height: 14.0),
                        _body(helpString[22]),
                        SizedBox(height: 14.0),
                        _body(helpString[23]),
                        SizedBox(height: 14.0),
                        _body(helpString[24]),
                        SizedBox(height: 14.0),
                        _body(helpString[25]),
                        SizedBox(height: 14.0),
                      ],
                    ),
                  ),
                ),
              ),
            ),
            Container(
              width: MediaQuery
                  .of(context)
                  .size
                  .width,
              color: Theme
                  .of(context)
                  .primaryColor,
              child: Center(
                child: Text(
                  'منبع : ویکی پدیا',
                  style: TextStyle(fontSize: 18.0),
                ),
              ),
            )
          ],
        ));
  }
}
